commands_templates/GetPresetTourOptions0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver20/ptz/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:GetPresetTourOptions>
         <!--type: ReferenceToken-->
         <wsdl:ProfileToken>?</wsdl:ProfileToken>
         <!--Optional:-->
         <!--type: ReferenceToken-->
         <wsdl:PresetTourToken>?</wsdl:PresetTourToken>
      </wsdl:GetPresetTourOptions>
   </soap:Body>
</soap:Envelope>